results/factorial-final/security-overhead-final-mtls-broker5/security-overhead-final-factorial-mtls-b5-rf5-isr4-msg1024-tps1000-batch16384-acks1-prod12-complz4-trial2/producer-perf-10.log
producer_index=10
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.00 MB/sec), 16208.0 ms avg latency, 16208.0 ms max latency.
1765 records sent, 352.2 records/sec (0.34 MB/sec), 3535.2 ms avg latency, 5511.0 ms max latency.
420 records sent, 83.9 records/sec (0.08 MB/sec), 27.0 ms avg latency, 106.0 ms max latency.
417 records sent, 83.3 records/sec (0.08 MB/sec), 16.0 ms avg latency, 74.0 ms max latency.
414 records sent, 82.7 records/sec (0.08 MB/sec), 13.4 ms avg latency, 41.0 ms max latency.
417 records sent, 83.1 records/sec (0.08 MB/sec), 14.0 ms avg latency, 42.0 ms max latency.
417 records sent, 83.3 records/sec (0.08 MB/sec), 14.1 ms avg latency, 42.0 ms max latency.
415 records sent, 82.9 records/sec (0.08 MB/sec), 13.1 ms avg latency, 55.0 ms max latency.
415 records sent, 82.9 records/sec (0.08 MB/sec), 12.9 ms avg latency, 50.0 ms max latency.
416 records sent, 83.2 records/sec (0.08 MB/sec), 13.0 ms avg latency, 50.0 ms max latency.
416 records sent, 83.0 records/sec (0.08 MB/sec), 12.3 ms avg latency, 47.0 ms max latency.
416 records sent, 83.1 records/sec (0.08 MB/sec), 12.8 ms avg latency, 40.0 ms max latency.
416 records sent, 83.1 records/sec (0.08 MB/sec), 11.9 ms avg latency, 57.0 ms max latency.
415 records sent, 83.0 records/sec (0.08 MB/sec), 11.4 ms avg latency, 56.0 ms max latency.
416 records sent, 83.0 records/sec (0.08 MB/sec), 10.4 ms avg latency, 30.0 ms max latency.
416 records sent, 83.1 records/sec (0.08 MB/sec), 11.4 ms avg latency, 40.0 ms max latency.
415 records sent, 83.0 records/sec (0.08 MB/sec), 11.1 ms avg latency, 37.0 ms max latency.
8333 records sent, 82.743350 records/sec (0.08 MB/sec), 761.37 ms avg latency, 16208.00 ms max latency, 13 ms 50th, 4760 ms 95th, 5146 ms 99th, 5457 ms 99.9th.